packages/windmapper/windmapper-2.1.4-cp38-cp38-macosx_12_0_x86_64.whl/windmapper-2.1.4.data/data/share/windninja/ninjafoam/2.2.0/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default        steadyState;
}

gradSchemes
{
    default            cellMDLimited leastSquares 0.5;
}

divSchemes
{
    default                         none;
    div(phi,U)                      bounded Gauss linearUpwind grad(U);
    div(phi,k)                      bounded Gauss upwind;
    div(phi,epsilon)                bounded Gauss upwind;
    div(phi,omega)                  bounded Gauss 1.0;
    div(phi,nuTilda)                bounded Gauss 1.0;
    div((nuEff*dev(T(grad(U)))))    Gauss linear;
    div((nuEff*dev(grad(U).T())))   Gauss linear;
    div(phi,T)                      bounded Gauss limitedLinear 1;
}

laplacianSchemes
{
    default                         Gauss linear limited 0.333;
}

interpolationSchemes
{
    default         linear;
    interpolate(U)  linear;
}

snGradSchemes
{
    default             corrected;
    snGrad(T)           limited 0.5;
    snGrad(k)           limited 0.5;
    snGrad(epsilon)     limited 0.5;
    snGrad(omega)       limited 0.5;
    snGrad(nuTilda)     limited 0.5;
}

fluxRequired
{
    default         no;
    p;
}

// ************************************************************************* //
